# Lambda functions

In [1]:
#Normal function
def a_name(x):
    return x + x

In [2]:
#Lambda function 
lambda x: x+x

## Scalar values
Contains one argument-x-and one expression x*2

In [3]:
(lambda x: x*2)(12)

24

## Lists

#### 1. filter()
Returns values based on a condition

In [4]:
list_1 = [1,2,3,4,5,6,7,8,9]
even_nums = list(filter(lambda x: x%2==0, list_1))
even_nums

[2, 4, 6, 8]

In [5]:
list(even_nums)

[2, 4, 6, 8]

In [6]:
list_1 = [1,2,3,4,5,6,7,8,9]
cubed = map(lambda x: pow(x,3), list_1)
list(cubed)

[1, 8, 27, 64, 125, 216, 343, 512, 729]

#### 2. map()

Modifies every value in the list based on the expression. Returns the modified list

In [7]:
birth_year = [1979, 1987, 2015, 2017]
age = list(map(lambda x: 2021-x, birth_year))
age

[42, 34, 6, 4]

In [8]:
list_1 = [1,2,3,4,5,6,7,8,9]
cubed = map(lambda x: pow(x,3), list_1)
list(cubed)

[1, 8, 27, 64, 125, 216, 343, 512, 729]

In [9]:
float_nums = [0.3, 6.7, 8.5, 3.4, 9.0, 2.5, 3.45, 0.92]
rounded = map(lambda x:round(x, 1), float_nums)
list(rounded)

[0.3, 6.7, 8.5, 3.4, 9.0, 2.5, 3.5, 0.9]

##### Alternatives for map and filter

In [10]:
#Map
[pow(x,3) for x in list_1]

[1, 8, 27, 64, 125, 216, 343, 512, 729]

In [11]:
[float(x) for x in list_1]

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0]

In [12]:
#Filter
[x for x in list_1 if x%2!=0]

[1, 3, 5, 7, 9]

#### 3. sorted()

In [13]:
list_2 = ['Susan', 'Fred', 'Mercy', 'Andrew', 'Wycliff']
sorted(list_2, reverse=True)

['Wycliff', 'Susan', 'Mercy', 'Fred', 'Andrew']

## DataFrames

In [14]:
import pandas as pd

In [15]:
df = pd.DataFrame({
    'Name': ['Luke','Gina','Sam','Emma'],
    'Status': ['Father', 'Mother', 'Son', 'Daughter'],
    'Birthyear': [1976, 1984, 2013, 2016],
})

In [16]:
df

   Name    Status  Birthyear
0  Luke    Father       1976
1  Gina    Mother       1984
2   Sam       Son       2013
3  Emma  Daughter       2016

### Lambda on Series object

#### Apply()

In [17]:
df['age'] = df['Birthyear'].apply(lambda x: 2021-x)

In [18]:
df

   Name    Status  Birthyear  age
0  Luke    Father       1976   45
1  Gina    Mother       1984   37
2   Sam       Son       2013    8
3  Emma  Daughter       2016    5

In [19]:
df['Status'].apply(lambda x: 'Male' if x == 'Father' or x == 'Son' else 'Female')

0      Male
1    Female
2      Male
3    Female
Name: Status, dtype: object

In [20]:
#Same results as above without using lambda
def create_gender(value):
    if (value == 'Father') | (value == 'Son'):
        return 'Male'
    else:
        return 'Female'
    
df['Status'].apply(create_gender)

0      Male
1    Female
2      Male
3    Female
Name: Status, dtype: object

#### Filter()

In [21]:
list(filter(lambda x: x>18, df['age']))

[45, 37]

In [22]:
[x for x in df['age'] if x>18]

[45, 37]

#### Map()
Works similar to apply in this context

In [23]:
df['double_age'] = df['age'].map(lambda x: x*2)

In [24]:
df

   Name    Status  Birthyear  age  double_age
0  Luke    Father       1976   45          90
1  Gina    Mother       1984   37          74
2   Sam       Son       2013    8          16
3  Emma  Daughter       2016    5          10

In [25]:
df['Gender'] = df['Status'].map(lambda x: 'Male' if x=='Father' or x=='Son' else 'Female')

In [26]:
df

   Name    Status  Birthyear  age  double_age  Gender
0  Luke    Father       1976   45          90    Male
1  Gina    Mother       1984   37          74  Female
2   Sam       Son       2013    8          16    Male
3  Emma  Daughter       2016    5          10  Female

In [27]:
#Another way of creating gender column (with conditions)
df['Gender'] = ''
df.loc[(df['Status'] == 'Father') | (df['Status'] == 'Son'), 'Gender'] = 'Male'
df.loc[(df['Status'] == 'Mother') | (df['Status'] == 'Daughter'), 'Gender'] = 'Female'

In [28]:
df

   Name    Status  Birthyear  age  double_age  Gender
0  Luke    Father       1976   45          90    Male
1  Gina    Mother       1984   37          74  Female
2   Sam       Son       2013    8          16    Male
3  Emma  Daughter       2016    5          10  Female

### Lambda on entire Dataframe

In [29]:
df2 = pd.DataFrame({
    'col1': [0.21, 2.34, 11.7345],
    'col2': [4.567, 1.98, 0.97],
    'col3': [6.5, 4.652, 9.12]
})

In [30]:
df2

      col1   col2   col3
0   0.2100  4.567  6.500
1   2.3400  1.980  4.652
2  11.7345  0.970  9.120

In [31]:
#round-off all data into 1 decimal place

df2.apply(lambda x:round(x,1))

   col1  col2  col3
0   0.2   4.6   6.5
1   2.3   2.0   4.7
2  11.7   1.0   9.1

In [32]:
df

   Name    Status  Birthyear  age  double_age  Gender
0  Luke    Father       1976   45          90    Male
1  Gina    Mother       1984   37          74  Female
2   Sam       Son       2013    8          16    Male
3  Emma  Daughter       2016    5          10  Female

In [33]:
# Returns an error because .lower() only works 
# with strings. Here there is a mix of string and numeric columns

# df.apply(lambda x: x.str.lower())

In [34]:
# use apply on whole df, but select the columns inside lambda function
# changes the string columns to lower-case

df[['Name','Status']] = df.apply(lambda x: x[['Name','Status']].str.lower(), axis=1)

In [35]:
df

   Name    Status  Birthyear  age  double_age  Gender
0  luke    father       1976   45          90    Male
1  gina    mother       1984   37          74  Female
2   sam       son       2013    8          16    Male
3  emma  daughter       2016    5          10  Female

In [36]:
#Add 5 years to birthyear

df.apply(lambda x: x['Birthyear']+5, axis=1)

0    1981
1    1989
2    2018
3    2021
dtype: int64

## Discouraged use cases

#### 1. Assigning them to variables
Lambda functions are anonymous functions meant to be used without being assigned to a variable first. The code below goes against that

In [37]:
#bad

var_1 = lambda x: x+x
var_1(3)

6

In [38]:
#Good - use a normal def funtion

def add_itself(x): return x+x
add_itself(3)

6

In [39]:
#Bad

triple = lambda x: x*3
double = lambda x: x*2
square = lambda x: x*x

print(double(5))
print(triple(5))
print(square(5))

10
15
25

In [40]:
#Good

def triple(x): return x*3

#### 2. Using simple functions inside lambda functions

In [41]:
list_3 = [-2,3,4,-5,6,7,8,-5,3,2]

##### Experienting with some built-in python functions

##### abs()

In [42]:
#Bad

list(map(lambda x:abs(x), list_3))

[2, 3, 4, 5, 6, 7, 8, 5, 3, 2]

In [43]:
#Good

list(map(abs, list_3))

[2, 3, 4, 5, 6, 7, 8, 5, 3, 2]

##### round()

In [44]:
float_nums = [0.3, 6.7, 8.5, 3.4, 9.0, 2.5, 3.45, 0.92]

In [45]:
list(map(round, float_nums))

[0, 7, 8, 3, 9, 2, 3, 1]

In [46]:
#Takes 2 arguments hence requires lambda
list(map(lambda x: round(x,2), float_nums))

[0.3, 6.7, 8.5, 3.4, 9.0, 2.5, 3.45, 0.92]

##### pow()

In [47]:
#Pow takes 2 arguments
list(map(lambda x: pow(x, 2), float_nums))

[0.09,
 44.89,
 72.25,
 11.559999999999999,
 81.0,
 6.25,
 11.902500000000002,
 0.8464]

##### float()
converts values into floats

In [48]:
list_1 = [1,2,3,4,5,6,7,8,9]

In [49]:
list(map(float, list_1))

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0]

##### int()
converts values into ints

In [50]:
list(map(int, float_nums))

[0, 6, 8, 3, 9, 2, 3, 0]

##### type()
returns the types of values

In [51]:
mixed_list = [1, 'twins', 0.5]
list(map(type, mixed_list))

[int, str, float]

#### list comprehensions and generators

In [52]:
df

   Name    Status  Birthyear  age  double_age  Gender
0  luke    father       1976   45          90    Male
1  gina    mother       1984   37          74  Female
2   sam       son       2013    8          16    Male
3  emma  daughter       2016    5          10  Female

In [53]:
#Another way for creating age with list comprehension
[x for x in 2021-df['Birthyear']]

[45, 37, 8, 5]